import React from "react";
import InformationCard from "./InformationCard";
import { faHeartPulse, faTruckMedical, faTooth } from "@fortawesome/free-solid-svg-icons";
import "../Styles/Info.css";

function Info() {
  return (
    <div className="info-section" id="services">
      <div className="info-title-content">
        <h3 className="info-title">
          <span>เกี่ยวกับพวกเรา</span>
        </h3>
        <p className="info-description">
          เรานำบริการดูแลสุขภาพมาสู่ความสะดวกสบายของคุณ 
          โดยนำเสนอบริการทางการแพทย์แบบครบวงจรที่ตอบโจทย์ความต้องการของคุณ 
          แพลตฟอร์มของเราช่วยให้คุณสามารถเชื่อมต่อกับแพทย์ออนไลน์ผู้มีประสบการณ์ 
          เพื่อรับคำแนะนำทางการแพทย์จากผู้เชี่ยวชาญ ออกใบสั่งยาออนไลน์ และต่ออายุยาได้อย่างรวดเร็วทุกเมื่อที่คุณต้องการ
        </p>
      </div>

      <div className="info-cards-content">
        <InformationCard
          title="บริการฉุกเฉินทางการแพทย์"
          description="บริการดูแลกรณีฉุกเฉินของเราได้รับการออกแบบมาเพื่อเป็นการสนับสนุนที่คุณวางใจได้ในสถานการณ์วิกฤต 
                       ไม่ว่าจะเป็นอาการเจ็บป่วยกะทันหัน การบาดเจ็บ หรือปัญหาทางการแพทย์ใด ๆ ที่ต้องการการดูแลทันที
                       ทีมแพทย์และบุคลากรทางการแพทย์ของเราพร้อมให้บริการตลอด 24 ชั่วโมงทุกวัน เพื่อมอบการดูแลที่รวดเร็วและมีประสิทธิภาพแก่คุณ"
          icon={faTruckMedical}
        />

        <InformationCard
          title="หัวใจ"
          description="Oทีมแพทย์ผู้เชี่ยวชาญด้านหัวใจและผู้เชี่ยวชาญทางการแพทย์ของเราใช้เทคโนโลยีล้ำสมัยเพื่อตรวจประเมินสุขภาพหัวใจและหลอดเลือดของคุณ 
          พร้อมออกแบบแผนการรักษาเฉพาะบุคคล ตั้งแต่การตรวจสุขภาพอย่างละเอียดไปจนถึงการรักษาขั้นสูง เรามุ่งมั่นที่จะช่วยให้คุณรักษาหัวใจให้แข็งแรงและมีชีวิตที่เต็มเปี่ยมด้วยคุณภาพชีวิต."
          icon={faHeartPulse}
        />

        <InformationCard
          title="ศูนย์ทันตกรรม"
          description="ยิ้มได้อย่างมั่นใจด้วยบริการดูแลช่องปากของเรา ที่ตอบสนองทุกความต้องการด้านสุขภาพฟัน
           แพทย์ผู้เชี่ยวชาญของเรามีความสามารถในการให้การรักษาหลากหลาย ตั้งแต่การตรวจสุขภาพฟันประจำและทำความสะอาด 
           ไปจนถึงขั้นตอนด้านความงามและการฟื้นฟูฟัน."
          icon={faTooth}
        />
      </div>
    </div>
  );
}

export default Info;
